Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: མཚན་ལན་གསུམ་དུ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་ནས་ཚིག་འདི་སྐད་དུ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་ད་ལྟ་ན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སྐུ་ཚེའི་འདུ་བྱེད་བཏང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་ཕྱག་འཚལ་ལོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་ཕྱག་འཚལ་ནས། གསོལ་བ་འདེབས་ཀྱིས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་བདེ་བའི་སླད་དུ། ཆོས་ཀྱི་འཁོར་ལོ་ནི་རབ་ཏུ་བསྐོར། ཆོས་ཀྱི་སྒྲོན་མ་ནི་རབ་ཏུ་འབར་བར་མཛད། ཆོས་ཀྱི་ཆར་ནི་རབ་ཏུ་འབེབས། ཆོས་ཀྱི་ཆར་ནི་རབ་ཏུ་གཏོང་། ཆོས་ཀྱི་རྔ་ནི་རབ་ཏུ་རྡུང་།
en: “Śāriputra, a noble son or noble daughter who has entered the Śrāvakayāna, or has entered the Pratyeka­buddha­yāna, or has entered the Mahāyāna, or any other being who wishes for the highest, most complete enlightenment of buddhahood, should three times each day and three times each night, with the upper robe over one shoulder, kneel on the right knee, place palms together in homage, and say these words: “ ‘I pay homage to the buddha bhagavats, who in this present time in the worlds of the ten directions are giving up their composite life.

source: ཆོས་ཀྱི་རྔ་བོ་ཆེ་ནི་རབ་ཏུ་རྡུང་། ཆོས་ཀྱི་དུང་ནི་རབ་ཏུ་འབུད། ཆོས་ཀྱི་སྲོག་ཤིང་ནི་སྒྲེང་། ཆོས་ཀྱི་སྒྲོན་མ་ནི་མཆེད་པར་མཛད། སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་ཀྱི་སྦྱིན་པས་ནི་ཚིམ་པར་མཛད། ཉམ་བག་ཏུ་སྤྱོད་དུ་འཛུད་ཅིང་རེ་ཞིག་བཞུགས་སུ་གསོལ།
en: “ ‘Through my paying homage to those buddha bhagavats, and requesting them to turn the wheel of the Dharma, I pray that those buddha bhagavats, for the sake of benefit for many beings, for the happiness of many beings, out of compassion for the world, and for the welfare, benefit, and happiness of multitudes of beings, devas, and humans, turn the wheel of the Dharma, light the lamp of the Dharma, send down the rain of the Dharma, let fall the rain of the Dharma, beat the drum of the Dharma, beat the great drum of the Dharma, blow the conch of the Dharma, raise the central pillar of the Dharma, increase the lamp of the Dharma, and satisfy all beings with the gift of the Dharma.

source: གསོལ་བ་བཏབ་པའི་ཕུང་པོ་འདི་ཡང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ཏེ།
en: “ ‘I also dedicate this accumulation of supplications to the highest, most complete enlightenment.

source: ཇི་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་དེ་བཞིན་དུ་འདི་ཡོངས་སུ་བསྔོའོ་ཞེས་བརྗོད་པར་བྱའོ། །
en: I dedicate this in such a way that it is dedicated to the highest, most complete enlightenment.’

source: ཤཱ་རིའི་བུ་འདི་ནི་གསོལ་བ་གདབ་པའི་ཕུང་པོ་སྟེ།
en: “Śāriputra, this is the accumulation of supplications.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གསོལ་བ་གདབ་པའི་ཕུང་པོ་འདིས་གསོལ་བ་འདེབས་ན། བསོད་ནམས་མང་པོ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་སྐྱེད་དོ། །ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུའམ།
en: If a noble son or noble daughter were to supplicate with this accumulation of supplications, they would create immeasurably, incalculably greater merit.

source: རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཇི་སྙེད་པ་དེ་དག་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་བཀང་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་དབུལ་བ་ཕུལ་བ་བས། གང་གིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བསྐུལ་ན། དེ་ནི་དེ་བས་བསོད་ནམས་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་སྐྱེད་དོ། །
en: “Śāriputra, if a noble son or noble daughter were to make an offering to the tathāgatas of the entire trichiliocosm world realm filled with the seven jewels, someone who supplicates the tathāgatas to turn the wheel of the Dharma would create immeasurably, incalculably greater merit than that.

source: ཤཱ་རིའི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ལྟ་ཞོག་སྟེ། ཤཱ་རིའི་བུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དང་མཉམ་པ་ཇི་སྙེད་པ་དེ་དག་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་བཀང་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་དབུལ་བ་ཕུལ་བ་བས། གང་གིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་གསོལ་བ་བཏབ་ན། དེ་ནི་དེ་བས་བསོད་ནམས་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་སྐྱེད་དོ། །
en: “Śāriputra, let alone this trichiliocosm world realm—Śāriputra, if a noble son or noble daughter were to make an offering to the tathāgatas of as many trichiliocosm world realms filled with the seven jewels as there are grains of sand in the Ganges River, still, someone who supplicates the tathāgatas to turn the wheel of the Dharma would create immeasurably, incalculably greater merit than that.

source: ཤཱ་རིའི་བུ་ངས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་གསོལ་བ་བཏབ་སྟེ། དགེ་བའི་རྩ་བ་དེས་ན་ང་ལ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས། བཅོམ་ལྡན་འདས་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་།
en: Śāriputra, when in the past I was practicing bodhisattva conduct, I supplicated the tathāgatas to turn the wheel of the Dharma.

source: འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་བདེ་བའི་སླད་དུ། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བར་གསོལ་ཞེས་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བར་གསོལ་བ་བཏབ་བོ། །
en: It is because of that root of merit that Śakra, the lord of the devas, and Brahmā, the lord of Sahā, supplicated me to turn the wheel of the Dharma, saying, ‘Bhagavat, we pray that you turn the wheel of the Dharma for the sake of benefit for many beings, for the happiness of many beings, out of compassion for the world, and for the welfare, benefit, and happiness of multitudes of beings, devas and humans.’

source: ཤཱ་རིའི་བུ་ངས་སྔོན་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱད་པ་སྤྱོད་པ་ན། དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་རིང་དུ་བཞུགས་པར་གསོལ་ཏེ། དགེ་བའི་རྩ་བ་དེས་ནི་ང་མི་འཇིགས་པ་བཞི་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་།
en: “Śāriputra, when in the past I was practicing bodhisattva conduct, I prayed that the tathāgatas remain for a long time.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཐོབ་སྟེ། ངའི་དམ་པའི་ཆོས་ཀྱང་ཡུན་རིང་དུ་གནས་པར་འགྱུར་རོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: It is because of that root of merit that I have attained the four confidences, the ten strengths of the tathāgatas, the eighteen unique qualities of a buddha, the four discernments, great love, great compassion, and complete nirvāṇa, and that my Dharma will remain for a long time.”

source: བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཡང་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའམ། སེམས་ཅན་གཞན་དག་ཀྱང་རུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འཚལ་བས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བར་བགྱི་བའི་སླད་དུ། དགེ་བའི་རྩ་བ་རྣམས་ཇི་ལྟར་ཡོངས་སུ་བསྔོ་བར་བགྱི། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: When the Bhagavat had said that, Venerable Śāriputra asked the Bhagavat, “Bhagavat, how should a noble son or noble daughter who has entered the Śrāvakayāna, or has entered the Pratyeka­buddha­yāna, or has entered the Mahāyāna, or any other being who wishes for the highest, most complete enlightenment of buddhahood, dedicate their roots of merit in order to gain omniscience?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤཱ་རིའི་བུ་འདི་ལ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའམ། སེམས་ཅན་གཞན་དག་ཀྱང་རུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས། ཉིན་ལན་གསུམ། མཚན་ལན་གསུམ་དུ་ཚིག་འདི་སྐད་ཅེས། ཐོག་མ་དང་ཐ་མ་མ་མཆིས་པའི་འཁོར་བ་ན་འཁོར་བའི་ཚེ། བདག་གིས་དགེ་བའི་རྩ་བ་མངོན་པར་འདུས་བགྱིས་པར་གྱུར་པ། སངས་རྒྱས་སམ། ཆོས་སམ། དགེ་འདུན་ནམ། གང་ཟག་གམ། ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བ་རྣམས་སམ། སེམས་ཅན་གཞན་དག་ལ་ཡང་རུང་སྟེ། ཟན་ཆངས་གཅིག་ཙམ་སྩལ་བར་གྱུར་པ་དང་། འཆགས་པ་གང་ལགས་པ་དང་། གསོལ་བ་གདབ་པ་གང་ལགས་པ་དང་། སྐྱབས་སུ་མཆི་བ་གང་ལགས་པ་དང་། བསླབ་པའི་གཞི་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་གང་ལགས་པ་དང་། སོ་སོར་འཆགས་པ་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་གང་ལགས་པ་དང་། རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བགྱི་བའི་དངོས་པོ་གང་ལགས་པ་དང་། གསོལ་བ་གདབ་པ་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་བསྡུས། གཞལ་བཟླུམས་ཏེ་སེམས་དུལ་ཞིང་རྣམ་པར་གྲོལ་བ་དང་། གཟུང་བ་མ་མཆིས་པས། སེམས་ཅན་ཐམས་ཅད་ལ་སྩལ་ཏོ། །
en: When Venerable Śāriputra had asked that, the Bhagavat said to him, “Śāriputra, a noble son or noble daughter who has entered the Śrāvakayāna, or has entered the Pratyeka­buddha­yāna, or has entered the Mahāyāna, or any other being who wishes for the highest, most complete enlightenment of buddhahood, should three times each day and three times each night say these words: “ ‘Whatever good roots I have created while circling in beginningless and endless saṃsāra—whatever good roots I have from giving even a handful of food to the Buddha, to the Dharma, to the Saṅgha, or even to those reborn as an animal, or to any other being; whatever good roots I have from confession, from supplication, from taking refuge, or from possessing the basis of the training; whatever good roots I have from individual confessions; whatever merit I have from rejoicing; and whatever good roots I have from supplication—I gather them all into one, and with a mind that is tamed, liberated, and without grasping, I bestow all of that together on all beings.

source: ཇི་ལྟར་དགེ་བའི་རྩ་བ་རྣམས་སེམས་ཅན་ཐམས་ཅད་ལ་གཏང་བར་བགྱི་བ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཆགས་པ་མི་མངའ་བས། ཇི་ལྟར་མཁྱེན་པ་དེ་ལྟ་བུས། བདག་གིས་དགེ་བའི་རྩ་བ་དེ་བཏང་སྟེ།
en: “ ‘Just as the buddha bhagavats, with the unimpeded wisdom of buddhahood, know their giving of the roots of merit to all beings, I give the roots of merit in the same way.

source: སེམས་ཅན་ཐམས་ཅད་ལག་ན་རིན་པོ་ཆེ་དང་ལྡན་པར་གྱུར་ཅིག །ནམ་མཁའི་མཛོད་དང་། ལོངས་སྤྱོད་ཟད་མི་ཤེས་པ་དང་། བསོད་ནམས་ཟད་མི་ཤེས་པ་དང་།
en: “ ‘May all beings have jewels in their hands.

source: ཆོས་ཟད་མི་ཤེས་པ་དང་། ཡེ་ཤེས་ཟད་མི་ཤེས་པ་དང་། སྤོབས་པ་ཟད་མི་ཤེས་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་གྱུར་ཅིག །
en: May they attain the treasury of space, enjoyment that knows no end, merit that knows no end, Dharma that knows no end, knowledge that knows no end, eloquence that knows no end, the highest, most complete enlightenment of buddhahood, and omniscient wisdom.

source: བདག་གིས་དགེ་བའི་རྩ་བ་འདི་སེམས་ཅན་ཐམས་ཅད་ལ་སྩལ་བ་ལས་བྱུང་བའི་བསོད་ནམས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་བསྡུས། གཞལ་བཟླུམས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ། །
en: “ ‘I combine into one and unify whatever merit arises from my bestowing the roots of merit on all beings, and I dedicate it to the highest, most complete enlightenment.

source: དགེ་བའི་རྩ་བ་འདིས་བདག་དང་སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱང་ཐོབ་པར་གྱུར་ཅིག །
en: “ ‘Through this root of merit may I and all beings attain the highest, most complete enlightenment of buddhahood and may we attain omniscient wisdom.

source: ཇི་ལྟར་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ན། དེ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བར་བགྱི་བའི་སླད་དུ། དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་བསྔོས་པ་དེ་བཞིན་དུ། བདག་གིས་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བར་བགྱི་བའི་སླད་དུ། དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་བསྔོའོ། །
en: “ ‘Just as the bodhisattva mahāsattvas of the past, practicing for the sake of enlightenment, dedicated their roots of merit for the sake of omniscience, in that same way I also dedicate my roots of merit for the sake of omniscience.

source: དགེ་བའི་རྩ་བ་འདིས་བདག་དང་། སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱང་ཐོབ་པར་གྱུར་ཅིག །
en: “ ‘Through this root of merit may I and all beings attain the highest, most complete enlightenment of buddhahood and may we attain omniscient wisdom.

source: ཇི་ལྟར་མ་འོངས་པའི་དུས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ན། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བར་བགྱི་བའི་སླད་དུ། དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་བསྔོ་བར་འགྱུར་བ་དེ་བཞིན་དུ་བདག་གིས་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བར་བགྱི་བའི་སླད་དུ་དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་བསྔོའོ། །
en: “ ‘Just as the bodhisattva mahāsattvas of the future, practicing for the sake of enlightenment, will dedicate their roots of merit for the sake of omniscience, in that same way I also will dedicate my roots of merit for the sake of omniscience.

source: ཇི་ལྟར་དེ་ལྟ་ན་ད་ལྟར་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ན། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བར་བགྱི་བའི་སླད་དུ་དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་བསྔོ་བ་དེ་བཞིན་དུ། བདག་གིས་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྱུར་བར་བགྱི་བའི་སླད་དུ་དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་བསྔོའོ། །
en: “ ‘Just as the bodhisattva mahāsattvas of the present, practicing for the sake of enlightenment, dedicate their roots of merit for the sake of omniscience, in that same way I also dedicate my roots of merit for the sake of omniscience.

source: དགེ་བའི་རྩ་བ་འདིས་བདག་དང་སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱང་ཐོབ་པར་གྱུར་ཅིག །ཇི་ལྟར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་ཏེ། སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་བསམ་གྱིས་མི་ཁྱབ་པ། དྲི་མ་མེད་པ། ཤིན་ཏུ་དཀར་བ་ལ་བཞུགས་ནས། བདུད་སྡིག་ཅན་བཅོམ་སྟེ། ཤེས་པར་བགྱི་བ་དང་། བལྟ་བར་བགྱི་བ་དང་།
en: “ ‘Through this root of merit may I and all beings attain the highest, most complete enlightenment of buddhahood, and may we attain omniscient wisdom.

source: རྟོག་པར་བགྱི་བ་དང་། མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བགྱི་བ་གང་ཅི་ཡང་རུང་སྟེ། དེ་ཐམས་ཅད་ནམ་གྱི་ཐོ་རངས་སྐྱ་རེངས་འཆར་ཀར་སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་བདུད་རྩི་བརྙེས་ཏེ། འཆི་བ་མེད་པར་འགྲོ་བའི་ལམ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་བཞིན་དུ། བདག་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །
en: Just as the Bhagavat Tathāgata Śākyamuni sat upon the Bodhimaṇḍa; remained in the inconceivable, stainless, and extremely difficult samādhi of buddhahood; defeated evil Māra, and at dawn obtained the amṛta of wisdom that in an instant had all knowledge, had the view, had realization, had complete enlightenment, and had gained the buddhahood of the path to deathlessness, in that same way may I and all beings attain the highest, most complete enlightenment of buddhahood.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱང་ཐོབ་པར་གྱུར་ཅིག །ཇི་ལྟར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་དང་། འོད་མཆོག་དང་། འོད་དགེ་དང་། བསོད་ནམས་འོད་དང་། མི་འཁྲུགས་པ་དང་། སེང་གེ་དང་། འོད་ཟེར་བརྒྱ་པ་དང་། འོད་ཟེར་མཐོ་བ་དང་། འོད་ཀྱི་དྲ་བ་ཅན་དང་། རིན་ཆེན་འོད་འཕྲོ་དང་། འོད་འབར་དང་། སྣང་བའི་རྒྱལ་པོ་དང་། ཤིན་ཏུ་བརྒྱན་དང་། རིན་ཆེན་ཏོག་དང་། ཆོས་ཀྱི་རྒྱལ་མཚན་དང་། ཡན་ལག་མཆོག་ཅེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གཞན་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཇི་ཙམ་དུ་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་།
en: May we attain omniscient wisdom.

source: ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་བདེ་བའི་སླད་དུ། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ་དེ་བཞིན་དུ། བདག་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་།
en: “ ‘Just as the tathāgata arhat samyaksaṃbuddhas including the Bhagavat Tathāgata Amitābha, Varaprabha, Virtue of Light, Puṇyaprabha, Akṣobhya, Siṃha, Śatakiraṇa, Exalted Light Rays, Net of Light, Ratnārci, Prabhājvala, King of Illumination, Vibhūṣita, Ratnaketu, Dharmadhvaja, and Varāṅga, and other buddha bhagavats who attained the highest, most complete enlightenment of buddhahood, turned the wheel of the Dharma for the sake of benefit for many beings, for the happiness of many beings, out of compassion for the world, and for the welfare, benefit, and happiness of multitudes of beings, devas and humans, in the same way may I and all beings attain the highest, most complete enlightenment of buddhahood and turn the wheel of the Dharma for the sake of benefit for many beings, for the happiness of many beings, out of compassion for the world, and for the welfare, benefit, and happiness of multitudes of beings, devas and humans.’

source: སྨན་པ་དང་། བདེ་བའི་སླད་དུ། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བར་ཤོག་ཅིག་ཅེས་བརྗོད་པར་བྱའོ། །ཤཱ་རིའི་བུ་འདི་ནི་ཡོངས་སུ་བསྔོ་བའི་ཕུང་པོ་སྟེ།
en: “Śāriputra, that is the accumulation of dedication.

source: བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མས་ཡོངས་སུ་བསྔོ་བའི་ཕུང་པོ་འདིའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས། དཔེའི་བར་དུ་ཡང་མི་བཟོད་དོ། །ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་མདོ་འདི་ལེན་ཏམ།
en: The previous accumulations of merit cannot approach the vastness of this accumulation of dedication and cannot even serve as an analogy for it.

source: ཀུན་ཆུབ་པར་བྱེད་དམ། འཛིན་ཏམ། ཀློག་གམ། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ན། དེ་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་བས་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་སྐྱེད་དོ། །
en: “Śāriputra, a noble son or noble daughter who obtains this sūtra, learns it, possesses it, reads it, and teaches it widely to others will develop an even greater, incalculable, measureless accumulation of merit.

source: ཤཱ་རིའི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་སྔ་ཕྱི་མེད་པར་མིའི་ལུས་ཐོབ་པར་གྱུར་ལ། སྔ་ཕྱི་མེད་པར་མིའི་ལུས་ཐོབ་ནས་ཀྱང་། རང་བྱང་ཆུབ་ཐོབ་པར་གྱུར་ཏེ། དེ་དག་ལ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས་བསྟི་སྟང་དང་། ཕུ་དུད་དུ་བྱ་བའི་ཕྱིར། གོས་དང་། ཟས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་ཇི་སྲིད་འཚོའི་བར་དུ་བསྙེན་བཀུར་བྱས་ཏེ། རིམ་གྲོ་བྱ་བ་ལ་ལན་ཅིག་ཙམ་ཡང་རིན་པོ་ཆེའི་ཕུང་པོ་རི་རབ་ཙམ་གྱི་རིན་པོ་ཆེ་རྣམས་ཡོངས་སུ་ཟད་པར་བྱས་ལ། ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་། དེ་དག་གི་མཆོད་རྟེན་རིན་པོ་ཆེ་སྣ་བདུན་ཏེ། གསེར་དང་། དངུལ་དང་། མུ་ཏིག་དང་། བཻ་ཌཱུརྱ་དང་། ཤེལ་དང་། སྤུག་དང་། མུ་ཏིག་དམར་པོ་ལས་འཕང་དུ་དཔག་ཚད་བཅུ་པ་བྱས་ཏེ། དེ་དག་ལ་གདུགས་དང་། རྒྱལ་མཚན་དང་།
en: “Śāriputra, if all the past and future beings that are in a trichiliocosm world realm were to attain human bodies, and having gained human bodies, without distinction between past and future, were to each attain enlightenment, and if a noble son or noble daughter were to serve them throughout their lives with robes, food, bedding, medicine when ill, and requisites in order to honor them and revere them; and if they were to spend a heap of jewels the size of Sumeru each time they attended them; and if, when they had passed into nirvāṇa, they were to create stūpas for them ten yojanas high and made of the seven precious materials—gold, silver, pearls, beryl, crystal, white coral, and red pearls—and then make offerings to them with parasols, banners, flags, and streamers, then, Śāriputra, what do you think?

source: བ་དན་དང་། བ་དན་ཕྲ་མོ་རྣམས་ཀྱིས་མཆོད་པ་བྱས་ན། ཤཱ་རིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གཞི་དེ་ལས་བསོད་ནམས་མང་དུ་སྐྱེད་དམ།
en: Would that noble son or noble daughter generate much merit upon that basis?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མང་ལགས་སོ། །
en: “Bhagavat, there would be much,” replied Śāriputra.

source: བདེ་བར་གཤེགས་པ་མང་ལགས་སོ། །བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུའམ།
en: “Sugata, there would be much.”

source: རིགས་ཀྱི་བུ་མོ་གང་མདོ་འདི་འཛིན་ཏམ། ཀུན་ཆུབ་པར་བྱེད་དམ། འདོན་པར་བྱེད་དམ། ཀློག་གམ། སྐྱེ་བོ་མང་པོ་ལ་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏམ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་འདེབས་ན།
en: “Śāriputra,” continued the Bhagavat, “a noble son or noble daughter who possesses this sūtra, learns it, recites it, reads it, teaches it to many people, and prays for the highest, most complete enlightenment will generate even greater merit.

source: དེ་ནི་དེ་བས་བསོད་ནམས་ཆེས་མང་དུ་སྐྱེད་དོ། །བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མས་བསོད་ནམས་ཀྱི་ཕུང་པོ་འདིའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས། དཔེའི་བར་དུ་ཡང་མི་བཟོད་དོ། །
en: The previous accumulations of merit cannot approach the vastness of this accumulation of merit; they cannot even serve as an analogy for it.

source: ཤཱ་རིའི་བུ་འདི་ལྟར་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་བསྒྲུབ་པ་འདི་ལ་གནས་ནས། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བསྐུལ་བའི་ཕྱིར་རོ། །
en: Śāriputra, it is because a noble son or noble daughter who is established in this practice requests the buddha bhagavats in the world realms in the ten directions to turn the wheel of the Dharma.

source: ཤཱ་རིའི་བུ་སྦྱིན་པ་རྣམས་ཀྱི་ནང་ན་འདི་ལྟ་སྟེ། ཆོས་ཀྱི་སྦྱིན་པ་མཆོག་ཅེས་ངས་བཤད་དོ། །
en: “Śāriputra, I have taught that the giving of the Dharma is the supreme act of generosity.”

source: དེ་ནས་འཁོར་དེ་ལས་སྲོག་ཆགས་ཁྲི་སྟན་ལས་ལངས་ཏེ། སོ་སོ་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: Then ten thousand beings within that assembly rose from their seats, and with their upper robes over one shoulder, knelt on their right knees, placed their palms together in homage, and bowed toward the Bhagavat.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་མདོ་འདི་གཟུང་བར་བགྱིའོ། །
en: They said to the Bhagavat, “Bhagavat, we will possess this sūtra.

source: གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་བསྟན་པར་བགྱིའོ། །
en: We will teach it widely to others.

source: བསྒྲུབ་པ་ལ་གནས་པར་བགྱིའོ། །
en: We will maintain its practice.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why is that?

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་དགེ་བའི་ཆོས་དེ་ལྟ་བུ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞིང་དོན་དུ་གཉེར་བ་ལགས་སོ། །
en: Bhagavat, it is because we are intent upon attaining the highest, most complete enlightenment of buddhahood through that kind of virtuous Dharma.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བཅོམ་ལྡན་འདས་དང་། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བས་མངོན་པར་གཏོར་ཏོ། །
en: Then Śakra, the lord of the devas, cast coral tree flowers over the Bhagavat and this Dharma teaching.

source: མངོན་པར་གཏོར་ནས་ཀྱང་། ཚིག་འདི་སྐད་ཅེས། བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་བསྐྲུན་པ་དང་། ལས་ཀྱི་སྒྲིབ་པ་རྒྱུན་གཅོད་པའི་གཅེས་སྤྲས་བགྱིད་པ་ལགས་སོ། །
en: Having scattered them, he said, “Bhagavat, this is a greatly cherished Dharma teaching that creates the roots of merit for bodhisattvas and ends the continuity of the obscuration of karma.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་དེ་བཞིན་ནོ། །ཀཽ་ཤི་ཀ་དེ་དེ་བཞིན་ཏེ།
en: “It is like that, Kauśika, it is like that,” said the Bhagavat.

source: ལྷའི་དབང་པོ་ངས་མངོན་པར་ཤེས་ཏེ། འདི་ནས་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པར་གྱུར་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་ཟེར་གྱི་ཕུང་པོ་ཆེན་པོ་ཞེས་བྱ་བ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ།
en: Lord of devas, I remember that innumerable eons beyond innumerable eons in the past, there appeared in the world a tathāgata arhat samyaksaṃbuddha, one with wisdom and pure conduct, a sugata, a knower of the world, an unsurpassable guide who tamed beings, a teacher of gods and humans, a buddha, a bhagavat named Great Mass of Light.

source: བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །ལྷའི་དབང་པོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་ཟེར་གྱི་ཕུང་པོ་ཆེན་པོ་དེའི་སྐུ་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ཐུབ་པར་གྱུར་ཏོ། །
en: “Lord of devas, the lifespan of the tathāgata arhat samyaksaṃbuddha Great Mass of Light was six hundred million years.

source: དེའི་ཉན་ཐོས་ཐོག་མར་འདུས་པ་ནི། བྱེ་བ་ཕྲག་འབུམ་ཡོད་དེ། ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ་ཤ་སྟག་གོ། །
en: His first assembly of śrāvakas numbered a trillion, and they were all arhats whose defilements had ceased.

source: དེའི་ཉན་ཐོས་འདུས་པ་གཉིས་པ་ནི་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་བརྒྱད་ཡོད་དེ། ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ་ཤ་སྟག་གོ། །
en: His second assembly of śrāvakas numbered ninety-eight trillion, and they were all arhats whose defilements had ceased.

source: དེའི་ཉན་ཐོས་འདུས་པ་གསུམ་པ་ནི་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་ཡོད་དེ། ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ་ཤ་སྟག་གོ། །
en: His third assembly of śrāvakas numbered ninety-nine trillion, and they were all arhats whose defilements had ceased.
